---
kind: other
id: Methods.T:Autodesk.Revit.DB.Architecture.TopographySurface
source: html/6e1f7d73-96a9-0c77-0c26-96f3939d511a.htm
---
# TopographySurface Methods

Adds points to a topography surface.